# Imports

In [1]:
import tensorflow as tf
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from IPython.display import clear_output
import six.moves
import tensorflow.compat.v2.feature_column as fc

In [2]:
print(tf.version)

<module 'tensorflow._api.v2.version' from 'C:\\ProgramData\\anaconda3\\lib\\site-packages\\tensorflow\\_api\\v2\\version\\__init__.py'>

# Dataset - Titanic dataset

In [3]:
train_data = pd.read_csv('https://storage.googleapis.com/tf-datasets/titanic/train.csv')
test_data = pd.read_csv('https://storage.googleapis.com/tf-datasets/titanic/eval.csv')

In [4]:
train_data.head()

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y

In [5]:
y_train = train_data.pop('survived')    # 1 means survived and 0 means did not survive

In [6]:
test_data.head()

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,35.0,0,0,8.0500,Third,unknown,Southampton,y
1,0,male,54.0,0,0,51.8625,First,E,Southampton,y
2,1,female,58.0,0,0,26.5500,First,C,Southampton,y
3,1,female,55.0,0,0,16.0000,Second,unknown,Southampton,y
4,1,male,34.0,0,0,13.0000,Second,D,Southampton,y

In [7]:
y_test = test_data.pop('survived')